{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "convnext_tiny_prestem_normalization", "trainable": false, "dtype": "float32", "axis": [-1], "invert": false, "mean": [123.675, 116.28, 103.53], "variance": [3409.9760250000004, 3262.6944000000003, 3291.890625]}, "registered_name": null, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "convnext_tiny_prestem_normalization", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras", "class_name": "Sequential", "config": {"name": "convnext_tiny_stem", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "convnext_tiny_stem_conv_input"}}, {"class_name": "Conv2D", "config": {"name": "convnext_tiny_stem_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [4, 4], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stem_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}]}, "registered_name": null, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "convnext_tiny_stem", "inbound_nodes": [[["convnext_tiny_prestem_normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "convnext_tiny_stage_0_block_0_depthwise_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_0_depthwise_conv", "inbound_nodes": [[["convnext_tiny_stem", 1, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stage_0_block_0_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_0_layernorm", "inbound_nodes": [[["convnext_tiny_stage_0_block_0_depthwise_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_0_block_0_pointwise_conv_1", "trainable": false, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_0_pointwise_conv_1", "inbound_nodes": [[["convnext_tiny_stage_0_block_0_layernorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_0_block_0_gelu", "trainable": false, "dtype": "float32", "activation": "gelu"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 384]}, "name": "convnext_tiny_stage_0_block_0_gelu", "inbound_nodes": [[["convnext_tiny_stage_0_block_0_pointwise_conv_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_0_block_0_pointwise_conv_2", "trainable": false, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 384]}, "name": "convnext_tiny_stage_0_block_0_pointwise_conv_2", "inbound_nodes": [[["convnext_tiny_stage_0_block_0_gelu", 0, 0, {}]]]}, {"module": "keras.src.applications.convnext", "class_name": "LayerScale", "config": {"name": "convnext_tiny_stage_0_block_0_layer_scale", "trainable": false, "dtype": "float32", "init_values": 1e-06, "projection_dim": 96}, "registered_name": "LayerScale", "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_0_layer_scale", "inbound_nodes": [[["convnext_tiny_stage_0_block_0_pointwise_conv_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_0_block_0_identity", "trainable": false, "dtype": "float32", "activation": "linear"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_0_identity", "inbound_nodes": [[["convnext_tiny_stage_0_block_0_layer_scale", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "tf.__operators__.add", "inbound_nodes": [["convnext_tiny_stem", 1, 0, {"y": ["convnext_tiny_stage_0_block_0_identity", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "convnext_tiny_stage_0_block_1_depthwise_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_1_depthwise_conv", "inbound_nodes": [[["tf.__operators__.add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stage_0_block_1_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_1_layernorm", "inbound_nodes": [[["convnext_tiny_stage_0_block_1_depthwise_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_0_block_1_pointwise_conv_1", "trainable": false, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_1_pointwise_conv_1", "inbound_nodes": [[["convnext_tiny_stage_0_block_1_layernorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_0_block_1_gelu", "trainable": false, "dtype": "float32", "activation": "gelu"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 384]}, "name": "convnext_tiny_stage_0_block_1_gelu", "inbound_nodes": [[["convnext_tiny_stage_0_block_1_pointwise_conv_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_0_block_1_pointwise_conv_2", "trainable": false, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 384]}, "name": "convnext_tiny_stage_0_block_1_pointwise_conv_2", "inbound_nodes": [[["convnext_tiny_stage_0_block_1_gelu", 0, 0, {}]]]}, {"module": "keras.src.applications.convnext", "class_name": "LayerScale", "config": {"name": "convnext_tiny_stage_0_block_1_layer_scale", "trainable": false, "dtype": "float32", "init_values": 1e-06, "projection_dim": 96}, "registered_name": "LayerScale", "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_1_layer_scale", "inbound_nodes": [[["convnext_tiny_stage_0_block_1_pointwise_conv_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_0_block_1_identity", "trainable": false, "dtype": "float32", "activation": "linear"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_1_identity", "inbound_nodes": [[["convnext_tiny_stage_0_block_1_layer_scale", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_1", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "tf.__operators__.add_1", "inbound_nodes": [["tf.__operators__.add", 0, 0, {"y": ["convnext_tiny_stage_0_block_1_identity", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "convnext_tiny_stage_0_block_2_depthwise_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_2_depthwise_conv", "inbound_nodes": [[["tf.__operators__.add_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stage_0_block_2_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_2_layernorm", "inbound_nodes": [[["convnext_tiny_stage_0_block_2_depthwise_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_0_block_2_pointwise_conv_1", "trainable": false, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_2_pointwise_conv_1", "inbound_nodes": [[["convnext_tiny_stage_0_block_2_layernorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_0_block_2_gelu", "trainable": false, "dtype": "float32", "activation": "gelu"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 384]}, "name": "convnext_tiny_stage_0_block_2_gelu", "inbound_nodes": [[["convnext_tiny_stage_0_block_2_pointwise_conv_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_0_block_2_pointwise_conv_2", "trainable": false, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 384]}, "name": "convnext_tiny_stage_0_block_2_pointwise_conv_2", "inbound_nodes": [[["convnext_tiny_stage_0_block_2_gelu", 0, 0, {}]]]}, {"module": "keras.src.applications.convnext", "class_name": "LayerScale", "config": {"name": "convnext_tiny_stage_0_block_2_layer_scale", "trainable": false, "dtype": "float32", "init_values": 1e-06, "projection_dim": 96}, "registered_name": "LayerScale", "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_2_layer_scale", "inbound_nodes": [[["convnext_tiny_stage_0_block_2_pointwise_conv_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_0_block_2_identity", "trainable": false, "dtype": "float32", "activation": "linear"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_stage_0_block_2_identity", "inbound_nodes": [[["convnext_tiny_stage_0_block_2_layer_scale", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_2", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "tf.__operators__.add_2", "inbound_nodes": [["tf.__operators__.add_1", 0, 0, {"y": ["convnext_tiny_stage_0_block_2_identity", 0, 0], "name": null}]]}, {"module": "keras", "class_name": "Sequential", "config": {"name": "convnext_tiny_downsampling_block_0", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 56, 56, 96], "dtype": "float32", "sparse": false, "ragged": false, "name": "convnext_tiny_downsampling_layernorm_0_input"}}, {"class_name": "LayerNormalization", "config": {"name": "convnext_tiny_downsampling_layernorm_0", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "convnext_tiny_downsampling_conv_0", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "convnext_tiny_downsampling_block_0", "inbound_nodes": [[["tf.__operators__.add_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "convnext_tiny_stage_1_block_0_depthwise_conv", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_0_depthwise_conv", "inbound_nodes": [[["convnext_tiny_downsampling_block_0", 1, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stage_1_block_0_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_0_layernorm", "inbound_nodes": [[["convnext_tiny_stage_1_block_0_depthwise_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_1_block_0_pointwise_conv_1", "trainable": false, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_0_pointwise_conv_1", "inbound_nodes": [[["convnext_tiny_stage_1_block_0_layernorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_1_block_0_gelu", "trainable": false, "dtype": "float32", "activation": "gelu"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 768]}, "name": "convnext_tiny_stage_1_block_0_gelu", "inbound_nodes": [[["convnext_tiny_stage_1_block_0_pointwise_conv_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_1_block_0_pointwise_conv_2", "trainable": false, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 768]}, "name": "convnext_tiny_stage_1_block_0_pointwise_conv_2", "inbound_nodes": [[["convnext_tiny_stage_1_block_0_gelu", 0, 0, {}]]]}, {"module": "keras.src.applications.convnext", "class_name": "LayerScale", "config": {"name": "convnext_tiny_stage_1_block_0_layer_scale", "trainable": false, "dtype": "float32", "init_values": 1e-06, "projection_dim": 192}, "registered_name": "LayerScale", "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_0_layer_scale", "inbound_nodes": [[["convnext_tiny_stage_1_block_0_pointwise_conv_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_1_block_0_identity", "trainable": false, "dtype": "float32", "activation": "linear"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_0_identity", "inbound_nodes": [[["convnext_tiny_stage_1_block_0_layer_scale", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_3", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "tf.__operators__.add_3", "inbound_nodes": [["convnext_tiny_downsampling_block_0", 1, 0, {"y": ["convnext_tiny_stage_1_block_0_identity", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "convnext_tiny_stage_1_block_1_depthwise_conv", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_1_depthwise_conv", "inbound_nodes": [[["tf.__operators__.add_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stage_1_block_1_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_1_layernorm", "inbound_nodes": [[["convnext_tiny_stage_1_block_1_depthwise_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_1_block_1_pointwise_conv_1", "trainable": false, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_1_pointwise_conv_1", "inbound_nodes": [[["convnext_tiny_stage_1_block_1_layernorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_1_block_1_gelu", "trainable": false, "dtype": "float32", "activation": "gelu"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 768]}, "name": "convnext_tiny_stage_1_block_1_gelu", "inbound_nodes": [[["convnext_tiny_stage_1_block_1_pointwise_conv_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_1_block_1_pointwise_conv_2", "trainable": false, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 768]}, "name": "convnext_tiny_stage_1_block_1_pointwise_conv_2", "inbound_nodes": [[["convnext_tiny_stage_1_block_1_gelu", 0, 0, {}]]]}, {"module": "keras.src.applications.convnext", "class_name": "LayerScale", "config": {"name": "convnext_tiny_stage_1_block_1_layer_scale", "trainable": false, "dtype": "float32", "init_values": 1e-06, "projection_dim": 192}, "registered_name": "LayerScale", "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_1_layer_scale", "inbound_nodes": [[["convnext_tiny_stage_1_block_1_pointwise_conv_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_1_block_1_identity", "trainable": false, "dtype": "float32", "activation": "linear"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_1_identity", "inbound_nodes": [[["convnext_tiny_stage_1_block_1_layer_scale", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_4", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "tf.__operators__.add_4", "inbound_nodes": [["tf.__operators__.add_3", 0, 0, {"y": ["convnext_tiny_stage_1_block_1_identity", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "convnext_tiny_stage_1_block_2_depthwise_conv", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_2_depthwise_conv", "inbound_nodes": [[["tf.__operators__.add_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stage_1_block_2_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_2_layernorm", "inbound_nodes": [[["convnext_tiny_stage_1_block_2_depthwise_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_1_block_2_pointwise_conv_1", "trainable": false, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_2_pointwise_conv_1", "inbound_nodes": [[["convnext_tiny_stage_1_block_2_layernorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_1_block_2_gelu", "trainable": false, "dtype": "float32", "activation": "gelu"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 768]}, "name": "convnext_tiny_stage_1_block_2_gelu", "inbound_nodes": [[["convnext_tiny_stage_1_block_2_pointwise_conv_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_1_block_2_pointwise_conv_2", "trainable": false, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 768]}, "name": "convnext_tiny_stage_1_block_2_pointwise_conv_2", "inbound_nodes": [[["convnext_tiny_stage_1_block_2_gelu", 0, 0, {}]]]}, {"module": "keras.src.applications.convnext", "class_name": "LayerScale", "config": {"name": "convnext_tiny_stage_1_block_2_layer_scale", "trainable": false, "dtype": "float32", "init_values": 1e-06, "projection_dim": 192}, "registered_name": "LayerScale", "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_2_layer_scale", "inbound_nodes": [[["convnext_tiny_stage_1_block_2_pointwise_conv_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_1_block_2_identity", "trainable": false, "dtype": "float32", "activation": "linear"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_stage_1_block_2_identity", "inbound_nodes": [[["convnext_tiny_stage_1_block_2_layer_scale", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_5", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "tf.__operators__.add_5", "inbound_nodes": [["tf.__operators__.add_4", 0, 0, {"y": ["convnext_tiny_stage_1_block_2_identity", 0, 0], "name": null}]]}, {"module": "keras", "class_name": "Sequential", "config": {"name": "convnext_tiny_downsampling_block_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 192], "dtype": "float32", "sparse": false, "ragged": false, "name": "convnext_tiny_downsampling_layernorm_1_input"}}, {"class_name": "LayerNormalization", "config": {"name": "convnext_tiny_downsampling_layernorm_1", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "convnext_tiny_downsampling_conv_1", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "convnext_tiny_downsampling_block_1", "inbound_nodes": [[["tf.__operators__.add_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "convnext_tiny_stage_2_block_0_depthwise_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_0_depthwise_conv", "inbound_nodes": [[["convnext_tiny_downsampling_block_1", 1, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stage_2_block_0_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_0_layernorm", "inbound_nodes": [[["convnext_tiny_stage_2_block_0_depthwise_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_2_block_0_pointwise_conv_1", "trainable": false, "dtype": "float32", "units": 1536, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_0_pointwise_conv_1", "inbound_nodes": [[["convnext_tiny_stage_2_block_0_layernorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_2_block_0_gelu", "trainable": false, "dtype": "float32", "activation": "gelu"}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 1536]}, "name": "convnext_tiny_stage_2_block_0_gelu", "inbound_nodes": [[["convnext_tiny_stage_2_block_0_pointwise_conv_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_2_block_0_pointwise_conv_2", "trainable": false, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 1536]}, "name": "convnext_tiny_stage_2_block_0_pointwise_conv_2", "inbound_nodes": [[["convnext_tiny_stage_2_block_0_gelu", 0, 0, {}]]]}, {"module": "keras.src.applications.convnext", "class_name": "LayerScale", "config": {"name": "convnext_tiny_stage_2_block_0_layer_scale", "trainable": false, "dtype": "float32", "init_values": 1e-06, "projection_dim": 384}, "registered_name": "LayerScale", "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_0_layer_scale", "inbound_nodes": [[["convnext_tiny_stage_2_block_0_pointwise_conv_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_2_block_0_identity", "trainable": false, "dtype": "float32", "activation": "linear"}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_0_identity", "inbound_nodes": [[["convnext_tiny_stage_2_block_0_layer_scale", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_6", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "tf.__operators__.add_6", "inbound_nodes": [["convnext_tiny_downsampling_block_1", 1, 0, {"y": ["convnext_tiny_stage_2_block_0_identity", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "convnext_tiny_stage_2_block_1_depthwise_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_1_depthwise_conv", "inbound_nodes": [[["tf.__operators__.add_6", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stage_2_block_1_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_1_layernorm", "inbound_nodes": [[["convnext_tiny_stage_2_block_1_depthwise_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_2_block_1_pointwise_conv_1", "trainable": false, "dtype": "float32", "units": 1536, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_1_pointwise_conv_1", "inbound_nodes": [[["convnext_tiny_stage_2_block_1_layernorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_2_block_1_gelu", "trainable": false, "dtype": "float32", "activation": "gelu"}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 1536]}, "name": "convnext_tiny_stage_2_block_1_gelu", "inbound_nodes": [[["convnext_tiny_stage_2_block_1_pointwise_conv_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_2_block_1_pointwise_conv_2", "trainable": false, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 1536]}, "name": "convnext_tiny_stage_2_block_1_pointwise_conv_2", "inbound_nodes": [[["convnext_tiny_stage_2_block_1_gelu", 0, 0, {}]]]}, {"module": "keras.src.applications.convnext", "class_name": "LayerScale", "config": {"name": "convnext_tiny_stage_2_block_1_layer_scale", "trainable": false, "dtype": "float32", "init_values": 1e-06, "projection_dim": 384}, "registered_name": "LayerScale", "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_1_layer_scale", "inbound_nodes": [[["convnext_tiny_stage_2_block_1_pointwise_conv_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_2_block_1_identity", "trainable": false, "dtype": "float32", "activation": "linear"}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_1_identity", "inbound_nodes": [[["convnext_tiny_stage_2_block_1_layer_scale", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_7", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "tf.__operators__.add_7", "inbound_nodes": [["tf.__operators__.add_6", 0, 0, {"y": ["convnext_tiny_stage_2_block_1_identity", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "convnext_tiny_stage_2_block_2_depthwise_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_2_depthwise_conv", "inbound_nodes": [[["tf.__operators__.add_7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "convnext_tiny_stage_2_block_2_layernorm", "trainable": false, "dtype": "float32", "axis": [3], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_2_layernorm", "inbound_nodes": [[["convnext_tiny_stage_2_block_2_depthwise_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_2_block_2_pointwise_conv_1", "trainable": false, "dtype": "float32", "units": 1536, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 384]}, "name": "convnext_tiny_stage_2_block_2_pointwise_conv_1", "inbound_nodes": [[["convnext_tiny_stage_2_block_2_layernorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "convnext_tiny_stage_2_block_2_gelu", "trainable": false, "dtype": "float32", "activation": "gelu"}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 1536]}, "name": "convnext_tiny_stage_2_block_2_gelu", "inbound_nodes": [[["convnext_tiny_stage_2_block_2_pointwise_conv_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "convnext_tiny_stage_2_block_2_pointwise_conv_2", "trainable": false, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 14, 14, 1536]}, "name": "convnext_tiny_stage_2_block_2_pointwise_conv_2", "inbound_nodes": [[["convnext_tiny_stage_2_block_2_gelu", 0, 0, {}]]]}, {"module": "keras.src.applications.convnext", "class_name": "LayerScale", "config": {"name": "convnext_tiny_stage_2_block_2_layer_scale", "trainable": false, "dtype": "float32", "init_values": 1e-06, "projection_dim": 384}, 